Examinator/src/InformationRegisters/ЗначенияНастроекИнтерактивныхРесурсовСУЗ/ЗначенияНастроекИнтерактивныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияНастроекИнтерактивныхРесурсовСУЗ</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Представление</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>CatalogRef.НастройкиИнтерактивногоРесурсаСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ЗначенияНастроекИнтерактивныхРесурсовСУЗ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПолучитьJSСтрокуНастроекРесурса(Ресурс) Экспорт

	// Выбираем значения настроек
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Настройка КАК Настройка,
		|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Номер КАК Номер,
		|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Значение КАК Значение,
		|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.Настройка.ИмяПеременной КАК ИмяНастройки
		|ИЗ
		|	РегистрСведений.ЗначенияНастроекИнтерактивныхРесурсовСУЗ КАК ЗначенияНастроекИнтерактивныхРесурсовСУЗ
		|ГДЕ
		|	ЗначенияНастроекИнтерактивныхРесурсовСУЗ.СсылкаНаОбъектСУЗ = &Ресурс
		|
		|УПОРЯДОЧИТЬ ПО
		|	Настройка,
		|	Номер";

	Запрос.УстановитьПараметр("Ресурс", Ресурс);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	// Формируем таблицу настроек
	
	ТаблицаНастроек = Новый ТаблицаЗначений();
	ТаблицаНастроек.Колонки.Добавить("Настройка");
	ТаблицаНастроек.Колонки.Добавить("Имя");
	ТаблицаНастроек.Колонки.Добавить("МассивЗначений");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаНастройки = ТаблицаНастроек.Найти(ВыборкаДетальныеЗаписи.Настройка, "Настройка");
		
		Если СтрокаНастройки = Неопределено Тогда
			
			СтрокаНастройки = ТаблицаНастроек.Добавить();
			
			СтрокаНастройки.Настройка      = ВыборкаДетальныеЗаписи.Настройка;
			СтрокаНастройки.Имя            = ВыборкаДетальныеЗаписи.ИмяНастройки;
			СтрокаНастройки.МассивЗначений = Новый Массив();
			
		КонецЕсли;
		
		СтрокаНастройки.МассивЗначений.Добавить(ВыборкаДетальныеЗаписи.Значение);

	КонецЦикла;

	// Формируем JS строку настроек
	
	СтрокаНастроек = "{";
	
	Если ТаблицаНастроек.Количество() > 0 Тогда
		
		Для каждого СтрокаНастройки Из ТаблицаНастроек Цикл
			
			Если СтрокаНастройки.МассивЗначений.Количество() = 1 Тогда
				
				ЗначениеНастройки = ПолучитьСтроковоеПредставлениеЗначенияНастройки(СтрокаНастройки.МассивЗначений[0]);
				
			Иначе
				
				ЗначениеНастройки = "[";
				
				Для каждого Значение Из СтрокаНастройки.МассивЗначений Цикл
					ЗначениеНастройки = ЗначениеНастройки + ПолучитьСтроковоеПредставлениеЗначенияНастройки(Значение) + ", "				
				КонецЦикла;
				
				ЗначениеНастройки = Лев(ЗначениеНастройки, СтрДлина(ЗначениеНастройки) - 2); // Убираем последнюю запятую
				
				ЗначениеНастройки = ЗначениеНастройки + "]";
				
			КонецЕсли;
			
			ПредставлениеЗначения = СтрокаНастройки.Имя + " : " + ЗначениеНастройки + ", ";
			
			СтрокаНастроек = СтрокаНастроек + ПредставлениеЗначения; 
			
		КонецЦикла;
		
		СтрокаНастроек = Лев(СтрокаНастроек, СтрДлина(СтрокаНастроек) - 2); // Убираем последнюю запятую
		
	КонецЕсли;
	
	СтрокаНастроек = СтрокаНастроек +  "}";
	
	Возврат СтрокаНастроек;
	
КонецФункции

Функция ПолучитьСтроковоеПредставлениеЗначенияНастройки(Значение)
	
	Если ТипЗнч(Значение) = Тип("ХранилищеЗначения") Тогда
		ДанныеЗначения = Значение.Получить();
	Иначе
		ДанныеЗначения = Значение;
	КонецЕсли;
	
	СтроковоеЗначение = """" + ОбщегоНазначенияСУКлиентСервер.JSСтрока(Строка(ДанныеЗначения)) + """"; 
	
	Возврат СтроковоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецЕсли
